---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipingDensity
source: html/d88eb5d3-232f-03af-03bb-703a5ed962c2.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipingDensity Property

Density, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipingDensity { get; }
```